{
  "document_compliance": [
    {
      "amendment_title": "Draft Food Safety and Standards (Food Products Standards and Food Additives) Amendment Regulations, 2025",
      "status": "unclear",
      "current_practices": [
        "Provides a product label with ingredient declaration, net weight, best‑before date, storage instructions, and barcode.",
        "Has a GST registration certificate indicating legal operation."
      ],
      "evidence": [
        "\"Ingredients: 100% Arabica Coffee Beans\" (Product Label)",
        "\"Net Weight: 250 g\" (Product Label)",
        "\"Best Before: 12 months from date of manufacture\" (Product Label)",
        "\"GST Number: 29ABCDE1234F2Z5\" (GST Certificate)"
      ],
      "gaps": [
        "No evidence of compliance with specific food additive limits or labeling requirements outlined in the amendment.",
        "Missing declaration of any food additives or preservatives used."
      ],
      "actions": [
        "Obtain the full text of the amendment and identify all additive limits and labeling obligations.",
        "Audit the product formulation to confirm no prohibited additives are present.",
        "Update the product label to include any required additive declarations or warnings.",
        "Prepare a compliance report and obtain sign‑off from the Quality Assurance Manager."
      ],
      "last_date": "Unknown",
      "deadline_text": "",
      "urgency": "Low"
    },
    {
      "amendment_title": "Draft Food Safety and Standards (Vegan Foods) Amendment Regulations, 2025",
      "status": "unclear",
      "current_practices": [
        "Product label lists only 100% Arabica coffee beans, implying no animal‑derived ingredients.",
        "No mention of vegan certification or labeling."
      ],
      "evidence": [
        "\"Ingredients: 100% Arabica Coffee Beans\" (Product Label)",
        "\"Manufacturer: CoffeeCo Pvt. Ltd., 123 Bean Street, Bengaluru, Karnataka, India\" (Product Label)"
      ],
      "gaps": [
        "No evidence of a vegan certification seal or compliance with vegan labeling standards.",
        "Unclear whether the amendment requires a specific vegan claim or certification."
      ],
      "actions": [
        "Review the amendment to determine vegan labeling requirements.",
        "If required, obtain a recognized vegan certification for the product.",
        "Add the appropriate vegan claim or certification seal to the label.",
        "Document the certification and update the label accordingly."
      ],
      "last_date": "Unknown",
      "deadline_text": "",
      "urgency": "Low"
    },
    {
      "amendment_title": "Draft Notification of Food Safety and Standards",
      "status": "unclear",
      "current_practices": [
        "Company holds a valid GST registration and has a product label with standard information.",
        "No specific notification or compliance action is evident."
      ],
      "evidence": [
        "\"GST Registration Certificate\" (GST Certificate)",
        "\"Product Label\" (Product Label)"
      ],
      "gaps": [
        "No record of receiving or responding to the draft notification.",
        "Unclear if any new compliance obligations are triggered."
      ],
      "actions": [
        "Obtain the full draft notification and identify any new obligations.",
        "Assess the impact on existing labeling, packaging, and product formulation.",
        "Implement required changes and document compliance.",
        "Submit acknowledgment or required documentation to the regulatory authority."
      ],
      "last_date": "Unknown",
      "deadline_text": "",
      "urgency": "Low"
    },
    {
      "amendment_title": "Food Safety and Standards (Labelling and Display) Amendment Regulations, 2025",
      "status": "unclear",
      "current_practices": [
        "Label includes ingredient list, net weight, best‑before date, storage instructions, and barcode.",
        "Packaging is vacuum‑sealed food‑grade foil pouch."
      ],
      "evidence": [
        "\"Ingredients: 100% Arabica Coffee Beans\" (Product Label)",
        "\"Net Weight: 250 g\" (Product Label)",
        "\"Best Before: 12 months from date of manufacture\" (Product Label)",
        "\"Packaging: Vacuum‑sealed, food‑grade foil pouch\" (Product Label)"
      ],
      "gaps": [
        "Uncertain whether the label meets all mandatory information fields (e.g., country of origin, allergen declaration, nutrition facts per 100g).",
        "No evidence of compliance with display requirements (e.g., shelf‑life, storage conditions)."
      ],
      "actions": [
        "Review the amendment to list all mandatory label fields.",
        "Verify that the current label contains all required information.",
        "Add any missing fields (e.g., country of origin, allergen statement).",
        "Ensure the display of the label meets the new visual and placement standards.",
        "Update the packaging design if necessary and obtain sign‑off from the Packaging Team."
      ],
      "last_date": "Unknown",
      "deadline_text": "",
      "urgency": "Low"
    },
    {
      "amendment_title": "Food Safety and Standards (Packaging) First Amendment Regulations, 2025",
      "status": "unclear",
      "current_practices": [
        "Product is packaged in a vacuum‑sealed, food‑grade foil pouch.",
        "Label includes best‑before date and storage instructions."
      ],
      "evidence": [
        "\"Packaging: Vacuum‑sealed, food‑grade foil pouch\" (Product Label)",
        "\"Best Before: 12 months from date of manufacture\" (Product Label)",
        "\"Storage Instructions: Keep in a cool, dry place away from sunlight and moisture.\" (Product Label)"
      ],
      "gaps": [
        "No evidence of compliance with new packaging material restrictions or labeling of packaging (e.g., recyclable, biodegradable).",
        "Unclear if the pouch meets the new packaging integrity or safety standards."
      ],
      "actions": [
        "Obtain the full text of the packaging amendment to identify material and labeling requirements.",
        "Test the current foil pouch for compliance with any new safety or environmental standards.",
        "If non‑compliant, source approved packaging materials and redesign the pouch.",
        "Update the label to include any required packaging information (e.g., recycling symbol).",
        "Document the change and secure sign‑off from the Packaging Compliance Officer."
      ],
      "last_date": "Unknown",
      "deadline_text": "",
      "urgency": "Low"
    }
  ]
}