{
  "amendments": [
    {
      "title": "Draft Food Safety and Standards (Food Products Standards and Food Additives) Amendment Regulations, 2025",
      "description": "Amendments to food products standards and food additives regulations",
      "affects": "Food manufacturers, Food distributors",
      "relevance_reason": "RoastCoffee is a food manufacturer and any changes to product standards or permissible additives could directly affect its coffee formulations.",
      "potential_impact": "May require reformulation of coffee blends or adjustment of ingredient listings to comply with updated standards.",
      "assumed_product_categories": [
        "Roasted coffee beans",
        "Instant coffee",
        "Coffee blends"
      ]
    },
    {
      "title": "Draft Food Safety and Standards (Vegan Foods) Amendment Regulations, 2025",
      "description": "Amendments to vegan foods regulations",
      "affects": "Vegan food manufacturers, Vegan food distributors",
      "relevance_reason": "Coffee is inherently vegan, so if RoastCoffee markets its products as vegan, the vegan‑food regulations could apply.",
      "potential_impact": "May necessitate verification of vegan claims, ingredient sourcing documentation, and possible label updates.",
      "assumed_product_categories": [
        "Roasted coffee beans",
        "Instant coffee",
        "Coffee blends"
      ]
    },
    {
      "title": "Draft Notification of Food Safety and Standards",
      "description": "The Food Safety and Standards Authority of India proposes to amend the Food Safety and Standards (Labelling and Display) Regulations, 2020.",
      "affects": "food manufacturers, food distributors, food retailers",
      "relevance_reason": "As a food manufacturer, RoastCoffee must comply with any new labelling and display requirements.",
      "potential_impact": "Changes to mandatory label information (e.g., ingredient list, nutritional information, allergen declarations) for coffee packaging.",
      "assumed_product_categories": [
        "Roasted coffee beans",
        "Instant coffee",
        "Coffee blends"
      ]
    },
    {
      "title": "Food Safety and Standards (Labelling and Display) Amendment Regulations, 2025",
      "description": "The Food Safety and Standards Authority of India amends the Food Safety and Standards (Labelling and Display) Regulations, 2020, to include changes to the labelling requirements for food products.",
      "affects": "food manufacturers, food distributors, food retailers",
      "relevance_reason": "RoastCoffee, as a manufacturer, must update its product labels to meet the revised labelling standards.",
      "potential_impact": "Potential redesign of packaging labels to incorporate new mandatory statements, font sizes, or format specifications.",
      "assumed_product_categories": [
        "Roasted coffee beans",
        "Instant coffee",
        "Coffee blends"
      ]
    },
    {
      "title": "Food Safety and Standards (Packaging) First Amendment Regulations, 2025",
      "description": "The Food Safety and Standards Authority of India amends the Food Safety and Standards (Packaging) Regulations, 2018, to include changes to the packaging requirements for food products.",
      "affects": "food manufacturers, food distributors, food retailers",
      "relevance_reason": "Packaging requirements apply to RoastCoffee’s product containers and materials.",
      "potential_impact": "May require adoption of new packaging materials, labeling placement, or compliance with updated safety and environmental standards.",
      "assumed_product_categories": [
        "Roasted coffee beans",
        "Instant coffee",
        "Coffee blends"
      ]
    }
  ]
}