{
  "document_compliance": [
    {
      "amendment_title": "Draft Food Safety and Standards (Food Products Standards and Food Additives) Amendment Regulations, 2025",
      "status": "non_compliant",
      "current_practices": [
        "Company has prepared an ingredient list for its product, listing wheat, sugar, milk powder, salt, vegetable oil, and cocoa powder with respective percentages."
      ],
      "evidence": [
        "\"Ingredient List\nIngredient Percentage\nWheat 50%\nSugar 20%\nMilk powder 10%\nSalt 2%\nVegetable oil 8%\nCocoa powder 5%\"",
        "\"GST Registration Certificate\nCompany: NutriFoods Pvt Ltd\nGST Number: 29ABCDE1234F2Z5\nAddress: 123 Industrial Park, Delhi, India\nDate of Registration: 05-Feb-2024\""
      ],
      "gaps": [
        "No evidence that the listed ingredients comply with the approved additive list or permissible limits under the amendment.",
        "No documentation of additive approval or certification.",
        "No record of a food safety audit or compliance declaration."
      ],
      "actions": [
        "Step 1: Obtain the official additive list from the regulatory authority (Responsible Person: Compliance Officer).",
        "Step 2: Cross‑check each ingredient against the list and permissible limits (Responsible Person: Quality Assurance).",
        "Step 3: If any ingredient is non‑compliant, either reformulate the product or obtain an exemption/approval (Responsible Person: R&D).",
        "Step 4: Prepare a compliance declaration and attach it to the ingredient list (Responsible Person: Compliance Officer).",
        "Step 5: File the declaration with the Food Authority and obtain a compliance certificate (Responsible Person: Legal).",
        "Step 6: Update the product label to reflect any changes and ensure all required information is present (Responsible Person: Marketing)."
      ],
      "last_date": "Unknown",
      "deadline_text": "Unknown",
      "urgency": "High"
    },
    {
      "amendment_title": "Draft Food Safety and Standards (Vegan Foods) Amendment Regulations, 2025",
      "status": "non_compliant",
      "current_practices": [
        "Product contains milk powder, indicating it is not vegan."
      ],
      "evidence": [
        "\"Ingredient List\nIngredient Percentage\nMilk powder 10%\""
      ],
      "gaps": [
        "Product is not labeled as vegan or non‑vegan.",
        "No declaration or certification confirming vegan status.",
        "No evidence of a separate vegan product line or segregation of production lines."
      ],
      "actions": [
        "Step 1: Decide whether to market the product as vegan or non‑vegan (Responsible Person: Product Manager).",
        "Step 2: If marketing as vegan, reformulate to remove all animal‑derived ingredients (Responsible Person: R&D).",
        "Step 3: If marketing as non‑vegan, add a clear non‑vegan disclaimer on the label (Responsible Person: Marketing).",
        "Step 4: Obtain a vegan certification from an accredited body if required (Responsible Person: Compliance Officer).",
        "Step 5: Update the ingredient list and label accordingly and file the updated documentation with the Food Authority (Responsible Person: Legal)."
      ],
      "last_date": "Unknown",
      "deadline_text": "Unknown",
      "urgency": "High"
    },
    {
      "amendment_title": "Food Safety and Standards (Labelling and Display) Amendment Regulations, 2025",
      "status": "unclear",
      "current_practices": [
        "No labeling information was provided in the submitted documents."
      ],
      "evidence": [
        "\"Ingredient List\nIngredient Percentage\nWheat 50%\nSugar 20%\nMilk powder 10%\nSalt 2%\nVegetable oil 8%\nCocoa powder 5%\""
      ],
      "gaps": [
        "Missing mandatory label elements such as product name, net quantity, best before date, storage conditions, and nutrition facts.",
        "No evidence of a display plan or compliance with shelf‑display requirements.",
        "No proof of a labeling audit or certification."
      ],
      "actions": [
        "Step 1: Review the amendment to list all required label elements (Responsible Person: Compliance Officer).",
        "Step 2: Design a compliant label template incorporating all mandatory information (Responsible Person: Marketing).",
        "Step 3: Conduct a labeling audit to verify accuracy of ingredient percentages and nutrition facts (Responsible Person: Quality Assurance).",
        "Step 4: Obtain a labeling compliance certificate from the Food Authority (Responsible Person: Legal).",
        "Step 5: Update all product packaging and display materials accordingly and file the updated documentation (Responsible Person: Operations)."
      ],
      "last_date": "Unknown",
      "deadline_text": "Unknown",
      "urgency": "Medium"
    },
    {
      "amendment_title": "Food Safety and Standards (Packaging) First Amendment Regulations, 2025",
      "status": "unclear",
      "current_practices": [
        "No packaging specifications or certifications were provided."
      ],
      "evidence": [
        "\"Ingredient List\nIngredient Percentage\nWheat 50%\nSugar 20%\nMilk powder 10%\nSalt 2%\nVegetable oil 8%\nCocoa powder 5%\""
      ],
      "gaps": [
        "No evidence that the packaging material meets the new safety and environmental standards.",
        "No documentation of packaging testing or certification.",
        "No record of compliance with labeling of packaging (e.g., recyclable symbol, material composition)."
      ],
      "actions": [
        "Step 1: Obtain the full text of the packaging amendment to identify required material specifications (Responsible Person: Compliance Officer).",
        "Step 2: Test current packaging materials for compliance with barrier, migration, and recyclability requirements (Responsible Person: Quality Assurance).",
        "Step 3: If non‑compliant, source approved packaging suppliers and update packaging design (Responsible Person: Procurement).",
        "Step 4: Conduct a packaging audit and obtain a compliance certificate from the Food Authority (Responsible Person: Legal).",
        "Step 5: Update product packaging, label the new packaging with required symbols, and file the updated documentation (Responsible Person: Operations)."
      ],
      "last_date": "Unknown",
      "deadline_text": "Unknown",
      "urgency": "Medium"
    }
  ]
}