{
  "amendments": [
    {
      "title": "Draft Food Safety and Standards (Food Products Standards and Food Additives) Amendment Regulations, 2025",
      "description": "Amendments to food products standards and food additives regulations",
      "affects": [
        "Food manufacturers",
        "Food distributors"
      ],
      "relevance_reason": "Nutri Foods imports and distributes food products, so changes to product standards and permitted additives may affect the compliance of its imported goods.",
      "potential_impact": "May require review of ingredient lists, additive approvals, and possible reformulation or sourcing adjustments for imported items.",
      "assumed_product_categories": [
        "All food categories imported for sale"
      ]
    },
    {
      "title": "Draft Food Safety and Standards (Vegan Foods) Amendment Regulations, 2025",
      "description": "Amendments to vegan foods regulations",
      "affects": [
        "Vegan food manufacturers",
        "Vegan food distributors"
      ],
      "relevance_reason": "If Nutri Foods imports vegan‑type products, the new vegan‑food rules would apply to its distribution activities.",
      "potential_impact": "Could impose labeling, ingredient, or certification requirements specific to vegan foods, affecting import clearance and marketability.",
      "assumed_product_categories": [
        "Plant‑based meat alternatives",
        "Dairy‑free beverages",
        "Vegan snacks"
      ]
    },
    {
      "title": "Food Safety and Standards (Labelling and Display) Amendment Regulations, 2025",
      "description": "The amendment aims to revise the labelling and display requirements for food products, specifically regarding nutrition information and labeling.",
      "affects": [
        "Food manufacturers",
        "Packaged food distributors"
      ],
      "relevance_reason": "As an importer of packaged foods, Nutri Foods must ensure that product labels meet the revised nutrition and display standards.",
      "potential_impact": "May necessitate label redesign, updated nutrition facts, and verification of compliance before products enter the Indian market.",
      "assumed_product_categories": [
        "Packaged ready‑to‑eat meals",
        "Snack foods",
        "Beverages",
        "Confectionery"
      ]
    },
    {
      "title": "Food Safety and Standards (Packaging) First Amendment Regulations, 2025",
      "description": "The amendment revises the packaging regulations for food products, focusing on the use of certain materials and compliance with safety standards.",
      "affects": [
        "Food manufacturers",
        "Packaging suppliers"
      ],
      "relevance_reason": "Imported goods must be packaged in materials that comply with the new safety standards, making this amendment relevant to Nutri Foods' supply chain.",
      "potential_impact": "May require verification of packaging material compliance, possible repackaging, or supplier changes to meet the new regulations.",
      "assumed_product_categories": [
        "All packaged food items imported for distribution"
      ]
    }
  ]
}