{
  "amendments": [
    {
      "title": "Food Safety and Standards (Labelling and Display) Amendment Regulations, 2025",
      "summary": "The amendment aims to revise the labelling and display requirements for food products, specifically regarding nutrition information and labeling.",
      "requirements": [
        "Revision of nutrition information labeling",
        "Update to labeling requirements for certain food products",
        "Inclusion of specific details on food labels",
        "Compliance with new labeling standards",
        "Display of nutrition information in a specific format",
        "Mandatory labeling for certain ingredients",
        "Update to labeling requirements for packaged foods"
      ],
      "details": "Companies must review and update their labeling and packaging to comply with the new regulations, ensuring that all required information is accurately displayed and easily accessible to consumers.",
      "deadlines": [
        {
          "date": "2026-07-01",
          "raw": "01 July 2026"
        }
      ],
      "affected_businesses": [
        "Food manufacturers",
        "Packaged food distributors"
      ],
      "impact": "High"
    },
    {
      "title": "Food Safety and Standards (Packaging) First Amendment Regulations, 2025",
      "summary": "The amendment revises the packaging regulations for food products, focusing on the use of certain materials and compliance with safety standards.",
      "requirements": [
        "Compliance with revised packaging material standards",
        "Use of approved packaging materials",
        "Labeling of packaging materials with specific information",
        "Adherence to safety standards for packaging",
        "Update to packaging regulations for certain food products",
        "Inclusion of specific details on packaging labels",
        "Mandatory compliance with new packaging standards"
      ],
      "details": "Companies must assess their packaging materials and processes to ensure compliance with the revised regulations, making necessary changes to maintain safety and quality standards.",
      "deadlines": [
        {
          "date": "Unknown",
          "raw": "effective from the date of publication in the Gazette"
        }
      ],
      "affected_businesses": [
        "Food manufacturers",
        "Packaging suppliers"
      ],
      "impact": "Medium"
    }
  ]
}